const defaultCustomer = [
    '东亭物业',
    '泰康',
    '联通',
    '东风安道拓金口',
    '东风安道拓沌口',
    '东风安通林',
    '北辰物流',
    '联想',
    '天马',
    '富士康',
    '安波福',
    '哈金森',
    '捷众',
    '安吉物流',
    '安吉通汇',
    '东原地产',
    '住电',
    '有家',
    '华工正源',
    '延锋汽车',
    '敏实',
    '恒通',
    '武汉通汇',
    '易点租',
    '心怡金口',
    '心怡蔡甸',
    '联想客服备件',
    '奇宏',
    '东泰盛',
    '马应龙',
    '上海交运',
    '远航物流',
    'Today',
    '天合汽车',
    '朗迪',
    '长联来福',
    '古河',
    '格力凌达',
    '南车',
    '美的',
    '李尔汽车',
    '中航上发',
    '格力小时工',
    '准时达',
    '华星光电',
    '长飞光纤',
    '金亭',
    '联明机械',
    '东风本田',
    '鸿图',
    '佛吉亚',
    '代招项目-陈学超',
    '代招项目-王大超',
    '代招项目-付俊杰',
    '代招项目-费天富',
    '代招项目-蒋坤佚',
    '代招项目-张学文',
    '代招项目-黄伟',
    '代招项目-段曾丽',
    '代招项目-李茂盛',
    '代招项目-曾金',
    '代招项目-李路',
    '代招项目-杨金',
    '代招项目-郑荆沙',
    '代招项目-李文强',
    '代招项目-李博',
    '代招项目-齐松亚',
    '通力',
    '人福药业',
    '中铁十一局',
    '去哪儿网外包',
    '小米有品外包',
    '美团外包',
    '美团外包',
    '格力外包',
    '邮政中心局',
    '邮政发投局',
    '邮政EMS',
    '物流-顺丰',
    '顺丰仓储',
    '顺丰冷链',
    '顺丰中转场',
    '江夏-中百',
    '东西湖-中百',
    '沃尔玛',
    '烟草外包',
    '孝感分公司',
    '黄石分公司',
    '洪湖分公司',
    '钟祥分公司',
    '爱斯达克',
    '中建钢构',
    '全时',
    '武汉客车',
    '中粮集团',
    '圣戈班',
    '铁塔',
    '绿枫叶',
    '华新汽车',
    '海外U',
    '施耐德',
    '友德',
    '华网电力',
    '李尔云鹤',
    '东风河西',
    '延锋安道拓',
    '三新书业',
    '法比特',
    '耀皮',
    '优尼科',
    '华工高理',
    '华工正源',
    '圣辉',
    '华楷',
    '爱普科斯',
    '孝感邮政',
    '孝感顺丰',
    '广发银行',
    '日丰',
    '鑫诠',
    '西普电子',
    '艾博',
    '上达电子',
    '威弘',
].map((item, index) => {
    let temp = ''
    let code = index + 1
    if (`${code}`.length === 3) {
        temp = `005${code}`
    } else if (`${code}`.length === 2) {
        temp = `0050${code}`
    } else {
        temp = `00500${code}`
    }
    return {
        name: item,
        code: temp,
        catCode: {
            name: '入职单位',
            code: '005',
        },
    }
})
const defaultPositions = [
    '部门经理',
    '社保文员',
    '项目经理',
    '助理',
    '项目总监',
    '保安',
    '招聘专员',
    '招聘主管',
    '驻厂专员',
    '社保专员',
    '社保主管',
    '宿舍管理员',
    '保洁员',
    '施工员',
    '物业管理员',
    '水电工',
    '销售主管',
    '销售代表',
    '简历文员',
    '培训主管',
    '培训专员',
    '猎头顾问',
    '经理',
    '行政文员',
    '会务主管',
    '会务专员',
    '餐管',
    '电工',
    '门岗',
    '技术专员',
    '开发组专员',
    '主管',
    '运营专员',
    '宣传专员',
    '客服专员',
    '客服主管',
    '会计',
    '出纳',
    '开票员',
    '银行出纳',
    '现金出纳',
    '司机',
    '员工',
].map((item, index) => {
    let temp = ''
    let code = index + 1
    if (`${code}`.length === 3) {
        temp = `001${code}`
    } else if (`${code}`.length === 2) {
        temp = `0010${code}`
    } else {
        temp = `00100${code}`
    }
    return {
        name: item,
        code: temp,
        catCode: {
            name: '岗位',
            code: '001',
        },
    }
})
const defaultTitle = ['高管', '项目总监', '员工', '经理', '主管'].map((item, index) => {
    let temp = ''
    let code = index + 1
    if (`${code}`.length === 3) {
        temp = `002${code}`
    } else if (`${code}`.length === 2) {
        temp = `0020${code}`
    } else {
        temp = `00200${code}`
    }
    return {
        name: item,
        code: temp,
        catCode: {
            name: '职级',
            code: '002',
        },
    }
})
const defaultAchievement = ['绩效', '回款'].map((item, index) => {
    let temp = ''
    let code = index + 1
    if (`${code}`.length === 3) {
        temp = `004${code}`
    } else if (`${code}`.length === 2) {
        temp = `0040${code}`
    } else {
        temp = `00400${code}`
    }
    return {
        name: item,
        code: temp,
        catCode: {
            name: '考核指标',
            code: '004',
        },
    }
})
const defaultKPI = ['份额', '缺职率'].map((item, index) => {
    let temp = ''
    let code = index + 1
    if (`${code}`.length === 3) {
        temp = `003${code}`
    } else if (`${code}`.length === 2) {
        temp = `0030${code}`
    } else {
        temp = `00300${code}`
    }
    return {
        name: item,
        code: temp,
        catCode: {
            name: '考核指标',
            code: '003',
        },
    }
})
